<?php
/**
 * Created by PhpStorm.
 * User: DEV_KKI
 * Date: 2018-05-24
 * File: fastop_g_api_config.php
 */

$config['ticket'] = '40E3F9EDACC974592C2E85924076246FECA1499A458C4B2D59CF318791413DB4AA6CCEE9E5A7E53795EE1A4329109A9DB44CF5DEDC1F1DE5BE0D6682512B44531294AABEB4587A267879E2CC0602431C69FC30E41CBC04A5B36CFB94653FF301';

$config['replace_text'] = array(
 '매독','면역','몰카','무좀','물뽕','반응','방지','변비','보강','보호','복수','부족','부종','분해','비만','비염','빈혈','사경','사시','살균','후浮','후溥'
,'생리','생약','설사','손실','수두','숙변','숙취','습진','식욕','신장','실신','알포','약효','억제','예방','완화','요폐','욕창','위암','위염','후符','후簿'
,'이명','이통','임질','자양','장염','저하','저해','정력','정화','제거','조루','조절','조증','조혈','죽임','중풍','증강','증상','증세','증진','후缶','후腐'
,'질병','질염','질환','차단','천식','체질','촉진','최고','충치','치료','치매','치유','치핵','콘돔','쾌변','탁월','탈구','탈모','특효','틱증','후腑','후膚'
,'폐렴','폐암','풍진','하혈','한방','항균','항암','항염','해독','해소','해열','향상','혈뇨','혈전','홀몬','화상','활성','황달','회복','회춘','후艀','후芙'
,'가품','각혈','간암','간염','간질','감기','감량','감소','감염','감청','감퇴','강심','강장','개선','건선','건염','결핍','결핵','경련','고환','후莩','후訃'
,'골절','九찌','衢찌','기미','기피','기흉','낙진','냉한','노화','농흉','뇌염','단독','담배','담配','담석','당뇨','대마','도찰','도청','도촬','후負','후賦'
,'독감','독소','두통','디兀','딜도','똥녀','똥여','로겐','루二','淚이','淚二','마약','모기','몰핀','발기','발狸','발理','발莉','發리','벌레','후賻','후赴'
,'嬪폴','彬폴','斌폴','檳폴','殯폴','浜폴','濱폴','瀕폴','牝폴','玭폴','貧폴','賓폴','頻폴','석궁','섹스','실탄','아편','야바','漁그','에눌','후釜','후阜'
,'으뜸','음낭','자위','직거','짝퉁','처방','코治','쾌락','퇴치','티티','폭약','폴魯','푸링','푸馬','푸不','푸付','푸俯','푸傅','푸剖','푸副','후附','후駙'
,'푸否','푸咐','푸埠','푸夫','푸婦','푸孚','푸孵','푸富','푸府','푸復','푸扶','푸敷','푸斧','푸浮','푸溥','푸父','푸符','푸簿','푸缶','푸腐','후鳧','흡착'
,'푸腑','푸膚','푸艀','푸芙','푸莩','푸訃','푸負','푸賦','푸賻','푸赴','푸趺','푸部','푸釜','푸阜','푸附','푸駙','푸鳧','해충','효과','효능','후趺','후部'
,'효험','후不','후付','후俯','후傅','후剖','후副','후否','후咐','후埠','후夫','후婦','후孚','후孵','후富','후府','후復','후扶','후敷','후斧','흥분','흥정'
,'舅찌','알 포','알.포','후두염','흥분제','흥분젤','히로뽕','버버鯉','협심증','호르몬','환각제','회충증','혈액암','혈우병','헤로인','헤쉬쉬','해시시'
,'각막염','간경화','간기능','간독소','간정화','간질환','간해독','갑상선','강화제','개동녀','개동여','개떵녀','개떵년','개떵여','개똥녀','개똥년','항산화'
,'개똥여','개풍녀','갱년기','건망증','건성안','건초염','게실염','결막염','결장암','결절종','경옥고','고농도','고농축','고막염','고매오','고메오','항당뇨'
,'고순도','고품질','고혈압','골수염','골수종','공신단','공진단','공포탄','관절염','교란기','구내염','구루병','구순열','권영길','근막염','기적의','한은정'
,'기폭제','기피제','김정은','나二키','나伊키','나利키','나吏키','나夷키','나姨키','나弛키','나彛키','나怡키','나易키','나李키','나梨키','나泥키','한예슬'
,'나爾키','나珥키','나理키','나痍키','나痢키','나移키','나罹키','나而키','나耳키','나肄키','나苡키','나荑키','나裏키','나裡키','나貽키','나貳키','피부병'
,'나邇키','나離키','나飴키','나餌키','羅이키','낙태약','난관염','난소염','난치병','난치성','날부핀','남성추','냉대하','녀똥개','녹내장','농가진','필로폰'
,'농신증','농피증','뇌졸중','뇌졸증','뇌종양','뇌진탕','뇌출혈','누바인','늑막염','니조랄','니코덤','다한증','닥터툴','담관염','담낭염','담석증','피부암'
,'대마초','대장암','대장염','도폭선','동요병','디스크','디톡스','뛰어난','라미실','라식스','러미라','러브젤','로개인','로게인','老렉스','魯렉스','피부염'
,'마진돌','맥립종','면역력','모낭염','모르핀','夢블랑','무소속','무좀약','문국현','민주당','박근혜','방광염','방사능','방사성','배정남','백내장','폐기종'
,'백반증','백일해','백혈병','버버利','버버理','버버裏','버버離','복막염','볼거리','부인병','부작용','부정맥','불家리','불로초','불면증','불안증','프羅多'
,'불임증','불치병','비폴립','뽕알탄','사마귀','생리통','성기능','성생활','성유리','성인병','성인젤','성홍열','세노젠','소화력','송혜교','수면제','폐부종'
,'슈즈러','식도염','식중독','신결석','신경염','신경증','신경통','신부전','신비의','신생물','신장병','심근염','심근증','심장병','아구창','아이봉','프羅다'
,'아토피','안검염','알러지','알馬니','알포칩','애누리','야뇨증','야떵개','야일라','야콥병','에드빌','엘라이','엠빅스','여드름','여떵개','여똥개','프라茶'
,'역경매','열사병','吳메가','오스칼','오십견','옥구슬','요도염','요붕증','요실금','요힘빈','우수한','우울증','위궤양','위장염','유방암','유방염','폐경기'
,'윤활젤','이명박','이인제','이회창','인두염','자궁암','잠함병','장기능','장폐색','저혈압','정글칼','정동영','정온제','제계좌','중이염','즉거래','폐결핵'
,'지꺼래','지방간','직가능','직거래','직장탈','진통제','진폐증','처방약','척수염','천포창','총명탕','최고의','최음제','충수염','췌장암','췌장염','평온제'
,'치은염','칙칙이','코골이','코카인','콜레라','크론병','탈모증','퇴치제','티티칩','티파尼','티波니','파상풍','패혈증','노화 방지','5메오딥트','루貽비통'
,'혈액정화','혈전응고','호전반응','호지킨병','호흡곤란','홍색음선','후두개염','흑색화약','가스괴저','간경변증','간성혼수','개인거래','개인계좌','건강팬티'
,'건성습진','고기능성','고지혈증','골다공증','골연화증','급성위염','기관지염','기능저하','나녹시딜','난소종양','남성기력','남성정력','남자음위','낭심패트'
,'내고가능','네프로제','노화방지','니코레트','닌텐도칩','단독선두','단체추천','대사기능','도수수경','도수안경','독성물질','동맥경화','동맥질환','동정맥루'
,'두드러기','레비트라','레이노병','레지오나','롱러브젤','루二뷔똥','루李뷔똥','淚이뷔똥','淚李뷔똥','루이뷔通','루二뷔통','淚이뷔통','淚李뷔통','루이非똥'
,'루이飛똥','루二비똥','루李비똥','루李非똥','루李飛똥','淚이비똥','淚이非똥','淚이飛똥','淚二非똥','淚二飛똥','淚李비똥','淚李非똥','루이비通','루이備통'
,'루이悲통','루이批통','루이比통','루이碑통','루이費통','루이非통','루이飛통','루二비통','루彛비통','루李비통','루李비通','루李非통','루李飛통','루理비통'
,'루異비통','루荑비통','淚이비통','淚이비通','淚이非통','淚이飛통','淚이飛通','淚二비通','淚二非통','淚二飛통','淚二飛通','淚李비통','淚李非통','淚李飛통'
,'累이비通','류마티스','리바二스','理바李스','리포빈주','마리화나','만남거래','만성위염','만성피로','말라리아','매입가능','매입환영','멜라토닌','명품카피'
,'명현반응','모의총포','무연화약','무월경증','미녹시딜','미크로겐','바르비탈','바이러스','발기불능','방문구매','방문판매','베제트병','보툴리눔','복부비만'
,'불로장생','불로장수','비아그라','빅라이타','빅라이터','빠른구매','살빼는약','생리불순','생리활성','생식기능','성기단련','성기자극','성기확대','성인용품'
,'성인향수','세이프유','세포노화','세포치료','셀리악병','소화불량','수족냉증','시력장애','시신경염','시알리스','식욕부진','신경쇠약','신경질환','신부전증'
,'신우신염','신종플루','신진대사','심계항진','심근경색','심내막염','亞디다스','아디多스','아르마尼','아메바증','아스피린','아이도저','엑스타스','엑스타시'
,'엑스터시','연성하감','오줌소태','옥션해킹','왕라이타','왕라이터','외이도염','요오드약','요오드제','원폭차단','월경곤란','월경불순','유방농양','이경화증'
,'이진균증','인두결막','임신오조','임신자간','자궁근종','자위기구','자이데나','잔트렉스','장기판매','장수식품','장티푸스','재연물품','재연상품','전립선염'
,'전자담배','전자담配','전치태반','점액낭염','정력팬티','제왕절개','조루방지','조루예방','조정가능','조혈기능','조혈작용','주문쇄도','지익거래','직접거래'
,'체험수기','카바젝트','카버젝트','카피상품','타미플루','타이레놀','통장거래','특수제법','파킨슨병','판막질환','페라가母','페라加모','페라可모','페羅가모'
,'페레加모','페레家모','페레迦모','편도선염','편평태선','폴스美스','프로스카','피로회복','피부노화','피부미용','피부질환','핀페시아','하드로더','한나라당'
,'항알러지','허약체질','현금거래','혈당조절','혈압조절','혈액순환','호흡기장애','홈페이지를','쿠싱증후군','터너증후군','푸로세미드','프로세미드','프로페시아'
,'프리컨버터','플루옥세틴','가장큰효과','각막진균증','결절성홍반','고칼륨혈증','공신력있는','구역및구토','급성담낭염','급성인두염','급성췌장염','긴장성두통'
,'난치성질환','남성성기능','남성호르몬','내분비장애','노스페二스','노스페李스','盧스페李스','늑간신경통','니코레트껌','다운증후군','대통령선거','돌첸가마나'
,'突첸家바羅','디프테리아','라이증후군','라임관절염','류마티스열','만병의근원','만성췌장염','말초신경염','매입합니다','메니에르병','모닐리아증','몰래카메라'
,'무통장거래','문의는문자','민주노동당','방사능낙진','방사능예방','방사능제거','방사능차단','방사성차단','비만치료제','사구체신염','살사라진정','살사린과립'
,'삼차신경통','서혜육아종','성기능향상','성기확대기','세균성이질','세기관지염','세포치료제','소마트로핀','소화성궤양','시부트라민','식도정맥류','식욕억제제'
,'신경안정제','신비한변화','신생아황달','심상사상충','십전대보탕','亞베크롬費','안검내반증','열린우리당','외음부질염','요관의결석','요오드알약','유당불내증'
,'음낭주머니','이미테이션','인플루엔자','자궁경부염','자궁내막증','자궁섬유종','잠안오는약','전기충격기','전자충격기','정류고환증','정신분열증','좌골신경통'
,'중독성홍반','지토스골드','진동마사지','창조한국당','척추측만증','척추탈위증','척추후만증','첩모난생증','코골이방지','콜레스테롤','퇴행성관절염','하이드로시컷'
,'항히스타민제','홍체모양체염','히르시프룽병','가막성후두염','강직성척추염','거미막하출혈','결핵성흉막염','관상동맥질환','궤양성대장염','급성기관지염'
,'노카르디아증','뇌실질내출혈','닌텐도게임칩','다발성경화증','돌체앤家바나','라이터증후군','만성기관지염','말초혈관질환','메스암페타민','바이브래이터'
,'방사능치료제','보툴리눔독소','살모넬라감염','성기자극밴드','손가락안마기','수근관증후군','亞賣理칸李契','아토피피부염','악성후두종양','안면신경장애'
,'옥션개인정보','외음부소양증','울혈성심부전','월경전증후군','이미테이션티','전립선비대증','전염성연속종','죽상동맥경화','중증근무력증','지루성피부염'
,'감각신경성난청','난소기능저하증','뇌하수체의종양','대통합민주신당','믿을수있는제품','박사가추천하는','발기부전치료제','상장을수여하여','스패니쉬플라이'
,'신종인플루엔자','알레르기성비염','약사가추천하는','어린이아스피린','어청수경찰청장','의사가추천하는','인두편도비대증','자궁내막증식증','전정기능의장애'
,'혈관신경성부종','아스페르길루스증','이미테이션티셔츠','폐색성혈전혈관염','헤르페스성각막염','기관지확장증','기저귀피부염','기질성정신병'
,'갑상선기능저하증','갑상선기능항진증','과민성대장증후군','두점박이사슴벌레','만성폐쇄성폐질환','비궤양성소화불량','費費安웨스트宇드','성병성림프육아종'
,'단백동화스테로이드','아나볼릭스테로이드','전신성홍반성루푸스','프론트라인플러스독','프론트라인플러스캣'
,'21세기순수자연식품','특발성혈소판감소성자반증','발釐코馳페레駕모','방사능 방지옷','돼지 발정제','직,거,래','직.거.래','GPS 교란장치','사nel','샤nel'
,'루2뷔똥','淚2뷔똥','淚2뷔통','루2비똥','루2非똥','루2飛똥','淚2비똥','淚2非똥','루2비통','루2非통','루2飛통','淚2비통','淚2非통','淚2飛통','루이B똥'
,'루二B똥','淚이B똥','루이B통','루二B통','淚이B통','루이V똥','루二V똥','淚이V똥','루이V통','루二V통','淚이V통','sm용품','루이vi통','TV컨버터','DS티티'
,'F컵쿠키','알.포.칩','성인 용품','닌텐도/칩','도수 수경','도수 안경','특sa급','티티ds','까르디e','R4칩','SA급','TT칩','MK4-Key','DS-Xtreme','EZ-FlashV'
,'imitation','marihuana','Melatonin','melatonin','Minoxidil','Diet-Aids:','GPS Jamming','K6SuperCard','M3Passcard3','louisvuitton','N5Revolution','rogaine'
,'PreserVision','preservision','antihistamine','louis vuitton','DSFireLinkCard','SuperCardDSOne','MoonMediaPlayer','CycloDSEvolution','Lamisil','zantrex'
,'Caltrate','cannabis','Citracal','DSLinker','microgen','morphine','NicoDerm','G6DS','H1N1','M3DS','MDMA','clq','GHB','LSD','r 4','R,4','r.4','r/4','R_4'
,'Advil','d stt','d/stt','dildo','DS TT','DS.TT','DS/TT','DS_TT','dst_t','DST-T','DS-TT','opium','Oscal','AIDS','aids','Aids','Alli','DHEA','DSTT','condom'
,'DS.T.T','DSLink','heroin','N-Card','NSAIDs','Rogain','Viagra','AceKard','aspirin','centrum','cocaine','D.S.T.T','D_S-T_T','dstt/r4','ecstasy','i-doser','™'
,'http://www.watchguy.net/auction/10.gif','http://ikustom.co.kr/img_01/joyclocknaver.gif','http://hk4.ezeo.net/gallery/gallery.html?imp=2248','VUITTON','r4'
,'www.anywatch.org','www.joyclock.com','www.watchguy.net','www.ikustom.co.kr','www.macromedia.com','www.genevawatch.net','NinjapassX9DSFlasher','NinjaDS'
);
$config['replace_value']			= array('');

$config['replace_tag_target']		= array('<p>','<P>','•','복용');
$config['replace_tag_value']		= array('<p style="padding:0;margin:0;">','<p style="padding:0;margin:0;">','','섭취');

$config['replace_name_tag_target']	= array('[',']','™','!','@','#', '$', '^', '&', '*', '=', '\\', '"', "'", ',', '<', '>', '?','','','†','®','');
$config['replace_name_tag_value']	= '';

$config['chidren_safe_cert_category'] = array('300012976','300009286','300012977','300009315','300009326','300009314','300015911','300009477','300024147','300012920','300024767','300007307','300013062','300005812','300002625','300016163', '300012918', '300002630');

//$config['except_maker'] = array('Attitude','Tea forte', '','Munchkin','Burts Bees','THE DIRT');
//$config['except_item_code'] = array('1283544982', '1359959637', '1510488804', '1510675523', '1510728127', '1510728227', '1510728327', '1510744870', '1510744871', '1349824266', '1365628556', '1370581619', '1370639070', '1407183234', '1501141523', '1503208655', '1503209655', '1503210655', '1504304838', '1505205141', '1506232325', '1509187716', '1509196716', '1510314015', '1510412015', '1510482304', '1510482404', '1510508813', '1510508913','1510517513', '1510573722', '1510595330', '1510749681', '1510750181', '1510831415','1210012129', '1210591619', '1222682189', '1222827644', '1251860612', '1306524520','1511056740','1511056780');
//$config['error_item_code'] = array(
//	'1226402990','1283547790','1319575924','1370640134','1373606977','1412140837','1505210541','1510419615','1510935915','1510945715'
//,	'1510950515','1510970415','1510984115','1511011415','1511013515','1511013615','1398112823','1511053920','1510657619','1511261547'
//,	'1511129613','1511144815','1151295144','1374634392','1384985859','1510635949','1510683923','1511230335','1511243140'
//	/*1510657619,1511144815 2017-12-21*/
//	/*15106576192017-11-23*/
//	/*20180405*/
//); // error 상품 pass 처리용
//$config['bigger_it_id'] = '';


$config['return_shipping_fee']			='100000';
$config['price_rule']					= 1.1;
$config['use_price_discount']			= false;
$config['price_discount_rule_amount']	= 10;
$config['price_discount_rule_unit']		= 'Rate';
$config['price_discount_end_date']		= '2018-12-31';

$config['img_base_url']					= 'https://uvaxnqcpaepy770580.gcdn.ntruss.com/mall5/data/item/it_id_l1';
$config['virtual_item_code_name']		= 'it_id';

$config['view_blocks'] = array(
	'name_block'	=> 'item_description/fastople/item_name_block_tpl'
,	'desc_block'	=> 'item_description/fastople/item_desc_block_tpl'
,	'description'	=> 'item_description/fastople/item_description_tpl'
);


$config['supplement_fact_options_html'] = '
<div style="border:solid 2px #464646;">
	<section style="padding:20px 20px 10px 20px;color:#aaaeb8;border-bottom:solid 2px #464646;">
		<h1 style="font-size:1.3rem;font-weight:normal;color:#000;padding:0 0 10px 0;margin:0;">Supplement Facts</h1>
		<p style="padding:5px 0;margin:0;">Serving Size: %s</p>
		<p style="padding:5px 0;margin:0;">Servings Per Container: %s</p>
	</section>
	%s
	<section style="padding:10px 20px;border-top:solid 1px #464646; text-align:center;">
		<p></p>
	</section>
</div>';

$config['supplementfacts_data_html'] = '<table style="width:100%%;background-color:#eff5fb;padding:0;margin:0;" cellpadding="0" cellspacing="0">
		<thead>
			<tr>
				<th style="border-bottom:solid 1px #464646;padding:5px 0;margin:0;"></th>
				<th style="border-bottom:solid 1px #464646;border-left:solid 1px #464646;padding:10px;margin:0;color:#afb2bc;text-align:center;">Amount per Serving</th>
				<th style="border-bottom:solid 1px #464646;border-left:solid 1px #464646;padding:10px;margin:0;color:#afb2bc;text-align:center;">%% Daily Value</th>
			</tr>
		</thead>
		<tbody>
             %s
		</tbody>
	</table>';

$config['supplementfacts_data_row_html'] = '
			<tr>
				<td style="border-bottom:solid 1px #464646;padding:10px;margin:0;color:#000;text-align:left;">%s</td>
				<td style="border-bottom:solid 1px #464646;border-left:solid 1px #464646;padding:10px;margin:0;color:#000;text-align:right;">%s</td>
				<td style="border-bottom:solid 1px #464646;border-left:solid 1px #464646;padding:10px;margin:0;color:#000;text-align:right;">%s</td>
			</tr>
          ';